In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('titanic.csv')

In [7]:
df=data[[ 'survived', 'pclass', 'sex', 'age']]

In [8]:
df

     survived  pclass     sex   age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
886         0       2    male  27.0
887         1       1  female  19.0
888         0       3  female   NaN
889         1       1    male  26.0
890         0       3    male  32.0

[891 rows x 4 columns]

In [9]:
df['age_f']=df['age'].apply(lambda x: 'Valid' if x>18 else 'invalid')

c:\users\rmani\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [10]:
df

     survived  pclass     sex   age    age_f
0           0       3    male  22.0    Valid
1           1       1  female  38.0    Valid
2           1       3  female  26.0    Valid
3           1       1  female  35.0    Valid
4           0       3    male  35.0    Valid
..        ...     ...     ...   ...      ...
886         0       2    male  27.0    Valid
887         1       1  female  19.0    Valid
888         0       3  female   NaN  invalid
889         1       1    male  26.0    Valid
890         0       3    male  32.0    Valid

[891 rows x 5 columns]

In [11]:
def gender_cl(x):
    if x=='male':
        return 'M'
    else:
        return 'F'

In [14]:
df['sex']=df['sex'].apply(gender_cl)

c:\users\rmani\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
df

     survived  pclass sex   age    age_f gender
0           0       3   M  22.0    Valid      M
1           1       1   F  38.0    Valid      F
2           1       3   F  26.0    Valid      F
3           1       1   F  35.0    Valid      F
4           0       3   M  35.0    Valid      M
..        ...     ...  ..   ...      ...    ...
886         0       2   M  27.0    Valid      M
887         1       1   F  19.0    Valid      F
888         0       3   F   NaN  invalid      F
889         1       1   M  26.0    Valid      M
890         0       3   M  32.0    Valid      M

[891 rows x 6 columns]

In [16]:
# map

In [17]:
l=['10','20','30','40','50']

In [25]:
# map(function,iter)
m=sum(map(lambda x: int(x),l))

In [26]:
m

150

In [19]:
m

In [20]:
print(*m)

10 20 30 40 50

In [23]:
list(m)

[10, 20, 30, 40, 50]

In [24]:
l

['10', '20', '30', '40', '50']

In [27]:
d=map(lambda x: x**2,range(10))

In [28]:
list(d)

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [29]:
print(*map(lambda x: ' '*(10-x)+'* '*x,range(10)),sep='\n')

         *
        * *
       * * *
      * * * *
     * * * * *
    * * * * * *
   * * * * * * *
  * * * * * * * *
 * * * * * * * * *

In [30]:
import sqlalchemy

In [31]:
con=sqlalchemy.create_engine("mysql+pymysql://root@localhost:3306/stuu_data")

In [32]:
con

Engine(mysql+pymysql://root@localhost:3306/stuu_data)

In [33]:
df=pd.read_sql_table('student',con)

In [34]:
df

    id      name              email
0  101    manish  rmanish@gmail.com
1  102      shan     shan@gmail.com
2  103      jeet     jeet@gmail.com
3  104      neha     neha@gmail.com
4  109       ram     shan@gmail.com
5  105     harsh    harsh@yahoo.com
6  106  harpreet     har@outlook.in
7  107     manoj       jay@yahoo.in
8  108    manish     mann@gmail.com

In [35]:
yahoo_emails=pd.read_sql_query("select * from student where email like '%yahoo%'",con)

In [36]:
yahoo_emails

    id   name            email
0  105  harsh  harsh@yahoo.com
1  107  manoj     jay@yahoo.in

In [40]:
pd.read_sql_query("select name,email from student",con)

       name              email
0    manish  rmanish@gmail.com
1      shan     shan@gmail.com
2      jeet     jeet@gmail.com
3      neha     neha@gmail.com
4       ram     shan@gmail.com
5     harsh    harsh@yahoo.com
6  harpreet     har@outlook.in
7     manoj       jay@yahoo.in
8    manish     mann@gmail.com